/**
 * Created by wshwbluebird on 2017/6/8.
 */

const exec = require('child_process').exec;
const testModel = './bl/statistics/ML/CNNModel.py';

exports.CNNPredict ={
    /**
     *
     * @param code  股票代码
     * @param holdingPeriod  持仓天数
     * @param speedMode  1,2,3,4,5,6  最好为4
     * @param isENV      true/false   最好为false
     * @param testMode   All/batch    最好为ALL
     * @param beginStr   最好为2006-04-05
     * @param callback  形如(err,doc)
     * doc {JSON)
     * {
  process:      随着学习次数的增加 模型准确率在测试集上的表现
   [ 0,
     0,
     0,
     0,
     0,
     0.3799999952316284,
     0.5099999904632568,
     0.5099999904632568,
     0.5099999904632568,
     0.47999998927116394,
     0.47999998927116394,
     0.47999998927116394,
     0.47999998927116394,
     0.47999998927116394,
     0.47999998927116394,
     0.47999998927116394,
     0.49000000953674316,
     0.47999998927116394,
     0.47999998927116394,
     0.47999998927116394,
     0.47999998927116394,
     0.49000000953674316,
     0.49000000953674316,
     0.49000000953674316,
     0.5,
     0.5,
     0.5,
     0.5,
     0.550000011920929,
     0.5299999713897705,
     0.5799999833106995,
     0.6000000238418579,
     0.6399999856948853,
     0.6000000238418579,
     0.5400000214576721,
     0.6200000047683716,
     0.6200000047683716,
     0.6399999856948853,
     0.6499999761581421,
     0.6200000047683716,
     0.6200000047683716,
     0.6899999976158142,
     0.6600000262260437,
     0.699999988079071,
     0.75,
     0.7099999785423279,
     0.6499999761581421,
     0.6899999976158142,
     0.7599999904632568,
     0.7300000190734863,
     0.8100000023841858,
     0.7099999785423279,
     0.7099999785423279,
     0.75,
     0.7799999713897705,
     0.75,
     0.699999988079071,
     0.6800000071525574,
     0.7099999785423279,
     0.6700000166893005 ],

    '2.5-0': 0.9082311391830444,           涨幅为-2.5%~-0% 的概率
    '7.5-10': 5.135467138345229e-12,       涨幅为7.5%~10% 的概率
    '10-7.5': 0.0000048666679504094645,    涨幅为-10%~7.5% 的概率
    more10: 1.6069167330101664e-8,         涨幅大于10% 的概率
    '5-7.5': 2.3238451163365426e-8,        涨幅为5%~7.5% 的概率
    '2.5-5': 0.00000115536408884509,       涨幅为3.5%~5% 的概率
    '7.5-5': 0.0002716298622544855,        涨幅为-7.5%~-5% 的概率
    '0-2.5': 0.056888386607170105          涨幅为0%~2.5% 的概率
    less10: 2.2016003603519962e-11,        涨幅小于-10%的概率
    '5-2.5': 0.03460276871919632,          涨幅为5%~2.5% 的概率
    accuracy: 0.7200000286102295,  测试结果取概率最大时，在测试集上的准确度
  }
     */
    betterPredict : (code,holdingPeriod,speedMode,isENV,testMode,beginStr,callback)=>{
        console.time('NN')
        exec('python3' + ' ' + testModel + ' ' + code + ' ' + holdingPeriod+' '+speedMode+' '+isENV+' '+testMode+' '+beginStr, function(err, stdout, stderr){
            if(err) {
                console.log('stderr',err);
                callback(err)
            }
            if(stdout) {
                let ans = JSON.parse(stdout)
                console.timeEnd('NN')
                callback(err,ans)
            }

        });

    }
}

